#### 데이터 정렬

In [1]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='번호')
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

In [4]:
df.sort_values('점수')

     이름  주소  나이   점수      언어
번호
5번  박길동  광주  21   60     NaN
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
6번  나길동  서울  25   90       C
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN

In [5]:
df.sort_values('점수' , ascending=False)

     이름  주소  나이   점수      언어
번호
4번  홍길동  대전  20  100     NaN
3번  강길동  대구  30   98     C++
6번  나길동  서울  25   90       C
2번  이길동  서울  23   88    Java
1번  김길동  광주  33   76  Python
5번  박길동  광주  21   60     NaN

In [7]:
df.sort_values(['점수','나이'] , ascending=False)

     이름  주소  나이   점수      언어
번호
4번  홍길동  대전  20  100     NaN
3번  강길동  대구  30   98     C++
6번  나길동  서울  25   90       C
2번  이길동  서울  23   88    Java
1번  김길동  광주  33   76  Python
5번  박길동  광주  21   60     NaN

In [8]:
df.loc['3번', '점수']=90

In [9]:
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   90     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

In [10]:
df.sort_values(['점수','나이'] , ascending=False)

     이름  주소  나이   점수      언어
번호
4번  홍길동  대전  20  100     NaN
3번  강길동  대구  30   90     C++
6번  나길동  서울  25   90       C
2번  이길동  서울  23   88    Java
1번  김길동  광주  33   76  Python
5번  박길동  광주  21   60     NaN

In [11]:
df.sort_values(['점수','나이'] , ascending=[False, True])

     이름  주소  나이   점수      언어
번호
4번  홍길동  대전  20  100     NaN
6번  나길동  서울  25   90       C
3번  강길동  대구  30   90     C++
2번  이길동  서울  23   88    Java
1번  김길동  광주  33   76  Python
5번  박길동  광주  21   60     NaN

In [12]:
df['점수'].sort_values(ascending=False)

번호
4번    100
3번     90
6번     90
2번     88
1번     76
5번     60
Name: 점수, dtype: int64

In [13]:
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   90     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

In [15]:
df.sort_index(ascending=False)

     이름  주소  나이   점수      언어
번호
6번  나길동  서울  25   90       C
5번  박길동  광주  21   60     NaN
4번  홍길동  대전  20  100     NaN
3번  강길동  대구  30   90     C++
2번  이길동  서울  23   88    Java
1번  김길동  광주  33   76  Python